providers/InfoProviderSkelComponent/test/Invoker/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:skel="http://modalis.polytech.unice.fr/jSeduite/schema/InfoProvider/skel">
  <soapenv:Body>
    <skel:InfoProviderRequest>
      <skel:user>hall</skel:user>
      <skel:password>lllah</skel:password>
    </skel:InfoProviderRequest>
  </soapenv:Body>
</soapenv:Envelope>